fanmuzhi/STM32_ARM/Src/main.c
					uint16_t lightnessW_target = (uint16_t)s_RxBuff.UserRxBufferFS[1] + (((uint16_t)s_RxBuff.UserRxBufferFS[2])<<8);
					uint16_t lightnessIR_target = (uint16_t)s_RxBuff.UserRxBufferFS[3] + (((uint16_t)s_RxBuff.UserRxBufferFS[4])<<8);
					//adjust IR Led to lightnessIR_target
					AutoAdjustLed(&led_IR, &lightnessGauge, lightnessIR_target);
//					if(lightnessGauge.error != 0)
//					{
					vcp_lightdn_ret.error = lightnessGauge.error;
					vcp_lightdn_ret.lightnessIRDN = lightnessGauge.result_dn;
//					}
					vTurnOffLed(&led_IR);
					HAL_Delay(100);
					
					//adjust W Led to lightness_target
					AutoAdjustLed(&led_W, &lightnessGauge, lightnessW_target);
//					if(lightnessGauge.error != 0)
//					{
					vcp_lightdn_ret.error = lightnessGauge.error;
//					}
					vcp_lightdn_ret.lightnessWDN = lightnessGauge.result_dn;
					HAL_Delay(100);
					//re-light on IR LED again 
					vTurnOnLed(&led_IR, led_IR.last_led_tim_val);
					CDC_Transmit_FS((uint8_t *)(&vcp_lightdn_ret), sizeof(vcp_lightdn_ret));      //send back the detected light adc value
					break;
				}
				case VCP_CMD_SET_LED_TIM:
				{
					uint16_t ledW_level = (uint16_t)s_RxBuff.UserRxBufferFS[1] + (((uint16_t)s_RxBuff.UserRxBufferFS[2])<<8);
					uint16_t ledIR_level = (uint16_t)s_RxBuff.UserRxBufferFS[3] + (((uint16_t)s_RxBuff.UserRxBufferFS[4])<<8);
					vTurnOnLed(&led_W, ledW_level);
					vTurnOnLed(&led_W, ledIR_level);
					HAL_Delay(100);
					GetLightness(&lightnessGauge);
					CDC_Transmit_FS((uint8_t *)(&vcp_lightdn_ret), sizeof(vcp_lightdn_ret));       //send back the detected light adc value
					break;
				}
				case VCP_CMD_GET_LED_DN:
				{
					uint16_t vcp_ret_get_lightDN[2] = {0xFFFF, 0xFFFF};
					GetLightness(&lightnessGauge);
					vcp_ret_get_lightDN[0] = lightnessGauge.error;
					vcp_ret_get_lightDN[1] = lightnessGauge.result_dn;
					CDC_Transmit_FS( (uint8_t *)(&vcp_ret_get_lightDN), sizeof(vcp_ret_get_lightDN));       //send back the detected light adc value
					break;
				}
				
				default:	
					break;
			}
			s_RxBuff.IsCommandDataReceived = 0;
		}
    return 1;
}

void vTurnOnRgbLed( uint16_t r, uint16_t g, uint16_t b )
{
		HAL_GPIO_WritePin(led_R.gpio_x, led_R.gpio_pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(led_G.gpio_x, led_G.gpio_pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(led_B.gpio_x, led_B.gpio_pin, GPIO_PIN_SET);
}

void vTurnOffRgbLed(void)
{
		HAL_GPIO_WritePin(led_R.gpio_x, led_R.gpio_pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(led_G.gpio_x, led_G.gpio_pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(led_B.gpio_x, led_B.gpio_pin, GPIO_PIN_RESET);
}

uint16_t vTurnOnLed( Timer_Led_t *ledTimer, uint16_t ucLightness )
{
	if(ucLightness == 0x00)
	{
		vTurnOffLed(ledTimer);
		return 0;
	}
	ucLightness = (ucLightness > 0xFFF)?0xFFF:ucLightness;

  TIM_OC_InitTypeDef sConfigOC;             
	sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = (uint32_t)ucLightness;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  HAL_TIM_PWM_ConfigChannel(ledTimer->tim_handle, &sConfigOC, ledTimer->tim_channel);
               
	if(HAL_TIM_PWM_Start(ledTimer->tim_handle, ledTimer->tim_channel) != HAL_OK)
	{
		
	}
	ledTimer->last_led_tim_val = ucLightness;
	ledTimer->tim_started = 1;
	HAL_Delay(200);
	return 0;
}
uint16_t vTurnOffLed( Timer_Led_t *ledTimer)
{               
	if(HAL_TIM_PWM_Stop(ledTimer->tim_handle, ledTimer->tim_channel) != HAL_OK)
	{
		
	}
	ledTimer->tim_started = 0;
	return 0;
}

int32_t AutoAdjustLed(Timer_Led_t *ledTimer, Lightness_Gauge_t *lightGauge, uint16_t dn_target)
{
	uint16_t led_min = 0x0000, led_max = 0x0fff, led_low, led_high;
	
	GetLightness(lightGauge);
	if (lightGauge->error != 0)
	{
		return -1;
	}
	if(lightGauge->result_dn < dn_target)
	{
		led_low = ledTimer->last_led_tim_val;
		led_high = led_max;
	}
	else
	{
		led_low = led_min;
		led_high = ledTimer->last_led_tim_val;
	}
	while (led_low <= led_high) 
	{
		uint16_t led_middle = (led_low + led_high) / 2;
		vTurnOnLed(ledTimer, led_middle);
		GetLightness(lightGauge);
		if (lightGauge->error != 0)
		{
			return -1;
		}
		if (abs(lightGauge->result_dn - dn_target) <= lightGauge->gaugeMinScale)
		{
			return 0;
		}
		else if (lightGauge->result_dn > dn_target) 
		{
			led_high = led_middle-1;
		}
		else 
		{
			led_low = led_middle+1;
		}
	}
	return -1;
}

/**
  * @brief EXTI line detection callbacks
  * @param GPIO_Pin: Specifies the pins connected EXTI line
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if(GPIO_Pin == GPIO_PIN_1)
  {
    /* Switch LED White */
		if(led_W.tim_started != 0)
		{
			vTurnOffLed(&led_W);
		}
    else
		{
			vTurnOnLed(&led_W, 0x0FFF);
		}
//		CDC_Transmit_FS( UserTxBuffer,  sizeof(UserTxBuffer) );
  }  
	else if(GPIO_Pin == GPIO_PIN_9)
  {
    /* Switch LED IR */
		if(led_IR.tim_started != 0)
		{
			vTurnOffLed(&led_IR);
		}
    else
		{
			vTurnOnLed(&led_IR, 0x0FFF);
		}
//		CDC_Transmit_FS( UserTxBuffer,  sizeof(UserTxBuffer) );
  } 
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
